{
    
    
    "data":
    {
        "time":{
            
            "삼국" : "10",
            "남북국" : "4",
            "고려" : "11",
            "조선" : "24",
            "근대조선" : "13",
            "일제강점기" : "14",
            "해방이후" : "8",
            "복합" : "2",
            "전삼국" : "4",
            "기타" : "6"
        },
        
        "type":{
            "시기구분" : "17",
            "공간구분" : "4",
            "해석" : "31",
            "암기" : "19",
            "정리" : "6",
            "테마" : "18",
            "국가구분" : "2"
        },
        
        "theme":{
            "국가" : "4",
            "왕" : "9",
            "사건" : "22",
            "제도" : "11",
            "경제" : "5",
            "사회" : "5",
            "문화" : "15",
            "인물" : "9",
            "단체" : "9",
            "유물" : "3",
            "복합" : "4",
            "기타" : "2"
        }
        
        
        
    },
    "content":
    {
        "time":{
            "삼국" : "삼국 시대에서는 주요 주제로 등장한 횟수가 광개토대왕 3회, 지증왕 2회, 법흥왕 2회, 진흥 왕 4회 무열왕 3회, 성왕 5회 등이다. 복수로 등장한 것은 모두 기억해야겠지만, 흥미로운 점은 성왕과 진흥왕 사이의 관계가 아주 많이 등장하고 있다는 것이다. 6세기 백제의 중흥 기에 성왕과 진흥왕이 (이전부터 있었던) 혼인 동맹을 바탕으로 한강 유역을 되찾았으나, 진 흥왕이 약조를 깨고 백제의 영역인 한강 하류까지 모두 점령한다. 이에 성왕은 백제군을 일 으켜 신라를 공격하나, 관산성 전투에서 사망하게 된다. 이 맥락은 반드시 기억해두자. 성왕의 건을 제외하면 상대적으로 백제사는 그다지 다루어지지 않는 편이다. 그나마 주목할 부분은 장수왕에 의해 사망한 개로왕이나, 웅진 시대의 무령왕과 무령왕릉 정도일 것이다. 고구려에서는 광개토대왕, 장수왕이 빈번하게 등장한다. 각각 관련된 유적인 광개토대왕비, 중원고구려비를 제시하여 묻는 경우가 많으니 기억해두자. 이외에도 전성기를 준비한 소수 림왕(율령 반포, 불교 공인, ...)이나 수당전쟁기의 일(살수 대첩, 안시성 전투)는 빈출되므로 반드시 확인해두자.\n통일 이전의 신라에서는 지증왕(‘왕’ 명칭, ‘신라’ 국호, 우산국 정벌, 우경법)이 자주 등장하 고, 소수림왕과 비슷한 위치의 법흥왕(율령 반포, 불교 공인-이차돈의 순교) 등도 정답 보기 이건 오답 보기이건 가리지 않고 등장하므로 관련된 내용을 정리해두자. 위에서 이야기한 성왕과 진흥왕은 관계는 6세기 신라의 전성기 형성과 밀접한 관계가 있으니 기억해두자. 진 흥왕은 그와 관련된 4개의 순수비와 단양 적성비를 매개로 해서 등장한 경우가 있다.\n그 외에는 7세기, 통일 사업을 시작한 무열왕(김춘추), 통일을 완성한 문무왕이 종종 언급된 다. 특히 무열왕은 최초의 진골 계열의 왕이었으며, 그가 왕이 되기 이전에 외교관으로서 고 구려에 억류되었던 것이라거나 당에서 동맹을 맺은 사건 등을 기억해두자. 문무왕은 백제, 고구려 부흥 운동을 지원하며 나당 전쟁에서 승리하면서 통일 사업을 완성했으며 신문왕이 그의 뒤를 잇는다.\n삼국시대의 정치사는 위에서 언급한 왕들만 정리하면 거의 대부분은 맞힐 수 있다. 정말이 다. 백제는 근초고왕조차 거의 등장하지 않는다. 종종 오답 보기로 미천왕 정도가 언급될 뿐 이다.",
            "남북국" : "남북국 시대는 통일 신라 시대와 발해를 통틀어 지칭하는 용어이다. 통일 신라 시대에서는 통일 이후 왕권을 강화하면서 내치를 충실히 한 신문왕(6회)이 주로 다루어진다. 이와 같이 통일이나 개국 초기에 왕권을 강화하고 내치를 다진 인물로는 통일 신라의 신문왕(6회), 고 려 광종(2회), 조선 태종(5회)이 있으며 이들에 대해서는 한국사검정위원회 측에서 높은 비 중을 부여하고 있다. 신문왕은 왕권 강화라는 한 마디로 요약 가능한데, 김흠돌의 모반 사 건·국학 설립·녹읍 폐지·9주5소경 제도 모두 이와 연관해서 해석 가능하다. 그 외 종종 등장 하는 인물로는 경덕왕(녹읍 부활, 중국식 호칭 사용), 원성왕(독서삼품과), 진성 여왕(신라 하 대 몰락의 대표격, 원종과 애노의 난, 최치원)이 있으며 이들은 괄호 안의 키워드들만 확인 해두는 것이 효율적이다.\n발해의 왕은 더욱 간단하다. 1대 왕인 대조영은 종종 동모산에서 건국했다는 사실이 보기에 등장할 뿐, 그 외에는 특별히 언급되지 않는다. 발해는 주로 2대 왕인 무왕과 3대 왕인 문 왕 사이의 비교문제가 등장하며, 이들만 정리해두어도 발해 문제는 80% 이상 맞힐 수 있다. 이들은 각각 정벌(武), 내치(文)의 측면에서 성과를 거두었으며 업적의 성격이 뚜렷하게 갈리 므로 보기에서 빈번하게 등장한다. 번외로 종종 등장하는 것은 문왕보다 한참 뒷 세대의 인 물인 선왕으로, 그의 시대에 해동성국이라 불렸다는 점만 기억해두면 된다.",
            "고려" : "고려 시대부터는 시기 구분을 통해 차례차례 정리해두는 것이 좋다. 크게 건국 초기, 문벌 귀족 시기, 무신정권기, 대몽 항쟁과 원 간섭기, 고려 말기(공민왕)의 시기로 구분할 수 있다. 각 시대의 주요 키워드를 요약하면 다음과 같다.\n건국 초기: 태조 왕건(훈요 10조, 정계와 계백료서, 흑창, 그 외로 후삼국 시대의 견훤이 2차 례 기출), 광종(왕권 강화, 거란 대비 광군, 쌍기의 건의와 과거제, 노비안검법), 성종(12목 설 치, 서희의 담판)\n문벌 귀족 시기: 거란의 1-3차 침입(각각 서희, 강조, 강감찬), 김부식(묘청의 난, 삼국사기), 이자겸(거란=요에 사대, 이자겸의 난)\n무신정권기: 최충헌(그 앞에 정중부, 경대승 등이 있으나 대개 최충헌이 등장. 무신 관련 기 구들, 삼별초, 교정도감), 최우(대몽항쟁을 위한 강화도 천도, 팔만대장경, 정방)\n대몽 항쟁과 원 간섭기: 삼별초\n고려 말기: 공민왕(기철 등 권문세족 척결, 쌍성총관부 공격, 몽골풍 금지, 신진 사대부 등용, 신돈과 전민변정도감, 노국공주)\n위의 개념과 각각에 연관된 키워드는 한국사시험에서 자주 등장하는 항목들이므로 반드시 기억해두자. 또한 시대별, 사건별 선후 관계에도 주의깊게 살필 필요가 있다.",
            "조선" : "시험의 특성상, 현대에 가까울수록 더 많은 비중을 할애한다. 따라서 조선 시대는 단독으로 전체 시험 문제의 약 30% 가량을 차지하고, 근현대사는 그 자체로 50%를 차지한다. 조선은 임진왜란을 기점으로 전기와 후기로 가를 수 있으며, 고려와 마찬가지로 시기별, 순서별 구 분이 아주 중요하다. 위와 같이 시기별 구분 및 주요 개념을 정리해두겠다.\n개국 전후: 이성계(위화도 회군), 정도전·정몽주(급진, 온건 신진 사대부), 태종과 세종, 성종 (경국대전 완성, 사림파 등용)\n사화의 시기: 연산군(무오, 갑자), 중종(기묘, 조광조), 명종(을사, 임꺽정, 을묘왜변과 비변사) 임진왜란과 병자호란: 선조(동서 분당), 선조와 임진왜란-광해군의 중립외교-인조와 정묘·병 자호란\n예송 논쟁: 1차-서인(송시열), 2차-남인(윤휴)\n환국: 인현왕후(서인) vs. 장희빈(남인), 각각 서인-남인-서인의 승리 중흥기: 정조(초계문신제, 신해통공, 서자 기용, 장용영)\n그 외에도 조선부터는 테마별 정리가 주효하다. 시험 내에서 각각의 보기들이 서로 비교되 어 빈출되는 항목으로는 다음과 같다.\n- 태종과 세종\n- 사화\n- 선조와 임진왜란-광해군의 중립외교-인조와 병자호란까지의 흐름 - 두 차례에 걸친 예송 논쟁과 숙종의 환국\n- 중농주의 실학자(이익), 중상주의 실학자(박제가, 박지원), 정약용 - 조선의 중앙 정치 제도\n- 다른 시기와 비교되는 조선 후기의 사회경제적 특징\n거꾸로 잘 다루어지지 않는 항목들 역시 존재한다. 이 부분들은 가볍게 넘어가도 좋다.\n- 계유정난과 세조\n- 훈구파와 사림파의 대립\n- 노론과 소론, 시파와 벽파(복잡한 당 구분은 서인/동인에서 갈라진 북인(광해군), 남인의 3 가지로 충분하다)\n조선 후기의 경제, 사회상은 시험에서 빈출되므로 반드시 정리해두도록 하자. 특별히 암기하 기보다는 상품 작물의 재배나 덕대나 광작 등의 ‘경제 중시 성향이 드러나고’, 민화나 중인 의 동인회 등 ‘일반 백성의 문화가 발전했고’, ‘실학 등 영향이 나타났음’을 구별할 수 있으 면 충분하다. 역사는 현대사에서 가까울수록 보다 비중을 높게 두는 성격이 있기에, 근현대 사가 절반을 차지하고 그 다음으로 가까운 조선 후기를 많이 다루는 것이다.",
            "근대조선" : "근대 조선부터는 근현대사 파트에 해당한다. 국사와 근현대사 사이에는 세도정치~흥선 대원 군으로 이어지기는 하나, 특별히 주목되는 경우는 (전황과 같은 예를 제외하고는) 드물다. 근현대사부터는 주요 사건에 대한 연도 암기 역시 요구된다. 국사에 비하면 비교적 짧은 시 기의 역사를 밀도 높게 이해할 것을 요구하므로, 정석적인 방법이 유효하다. 우선 주요 테마 로는 다음과 같다.\n- 병인박해(1866), 제너럴 셔먼 호 사건(1866), 병인양요(1866), 오페르트 도굴 사건(1868),신미양요(1871), 척화비 건립(1871), 운요 호 사건(1875), 강화도 조약(1876)\n각각의 사건 순서 및 인과관계, 주요 사항에 대한 이해(e.g. 병인양요-외규장각 약탈)\n- 임오군란(1882, 조청상민수륙무역장정, 제물포 조약), 갑신정변(1884, 한성 조약, 톈진 조 약), 동학 농민 운동과 갑오개혁(1894)에 대한 상세한 이해. 특히 1894년의 사건은 국내외로 시간대가 겹쳐서 일어나는 일이 많으므로 제대로 정리해야함.\n- 국제 정세:청일전쟁(1894, 동학 농민 전쟁과 겹침, 청의 패배로 인한 조선 내 청의 입지 소실, 시모 노세키 조약으로 종결, 1905년 삼국 간섭으로 인한 조선 내 친러파 득세와 아관파천) 러일전쟁(1904, 독도 무단 침탈, 한일의정서)\n- 독립 협회의 활동과 아관파천(1896) 및 대한 제국의 형성(1897) 독립 협회의 활동에 대해서는 빈출되나, 대한 제국의 행적에 대해서는 비교적 묻지 않는 편이다.\n- 을미의병(1895), 을사의병(1905), 정미의병(1907) 정리\n- 일제의 국권 피탈 과정 정리 ,한일의정서(1904)-1차 한일협약(1904)-을사조약(1905)-정미 7조약(1907)",
            "일제강점기" : "일제 강점기는 크게 시대별 국내 상황과 독립 운동 관련으로 나눌 수 있다. 국내 파트에 있 어서는, 시대별로 각각 10년대(6회), 20년대(19회), 30년대(9회), 40년대(14회)로 골고루 등장 하고 있음을 알 수 있다. 일제 강점기는 시기 구분형 문제가 많다는 점을 고려해, 각각 시대 별 특징과 주요 사건을 구별할 수 있어야 한다.\n주된 방침과 사건들을 약술하면 다음과 같다.\n\n- 10년대: 무단 통치, 칼 찬 교사, 헌병 통치, 조선태형령, 토지 조사 사업, 회사령 반포 신민회 해산(105인 사건), 3.1. 운동과 대한민국 임시 정부 수립(1919)\n- 20년대: 문화 통치, 회사령 폐지, 산미 증식 계획, 치안 유지법(1925, 사회주의자 탄압)물산 장려 운동(대구), 형평사 운동, 6.10. 만세 운동(1926), 신간회(1927), 광주 학 생 항일 운동(1929)\n- 30년대 초: 농촌 진흥 운동,농촌 계몽 운동, 브나르도 운동\n- 37년 이후: 총동원 체제, 민족 말살 통치, 황국 신민 서사, 궁성요배, 창씨개명, 공출, 신사 참배, 징병과 징용... 특히 10년대 무단 통치와 37년 이후 총동원 체제의 유사성을 이용해 혼동을 주는 유형이 다수 등장한다. \n독립 운동 관련해서도 시대별로 구분하는 것이 최우선되어야 한다. 세세한 내용은 적지 않 겠으나, 각각의 활동에 대해 반드시 이해하고 암기해야 한다. 근현대사에서는 꼼수가 통하지 않는다. 특히 임정의 활동은 반드시 알아야 하는 것이, 헌법 전문에서 한국은 임시 정부의 적통을 계승한 것을 명시하고 있기에 한국의 국가 정체성과 관련된 문제이기 때문이다.\n- 강점 이전: 신민회(1907)\n- 10년대: 청산리 전투(서로 군정서, 김좌진+대한 독립군), 봉오동 전투(대한 독립군, 홍범도), 대한민국 임시정부, 의열단(김원봉, 신채호의 조선 혁명 선언)\n- 20년대: 국민 대표 회의(임정의 분열과 침체), 신간회(1927, 국내)\n- 30년대: 한인 애국단(이봉창, 윤봉길), 조선 의용대(의열단 출신, 이후 조선 혁명군으로 파생)\n- 40년대: 김구 주석 체제, 건국 강령 반포, 한국 광복군(지청천)\n그리고 근현대사에서는 인물 문제로 독립운동가를 묻는 경우가 대단히 많으므로, 빈출된 독립운동가들은 반드시 별도로 정리해두는 것을 권장한다. 정말 자주 등장하는 인물로 신채호,박은식, 안창호가 있다. 장군들은 대개 인물보다는 군사 단체 명칭으로 등장하는 경우가 많 다.",
            "해방이후" : "해방 이후에는 최근 헌법과 관련된 사회적 관심이 높아지면서 관련 문제가 고난이도로 자주 출제된다. 특히 1차 발췌 개헌, 2차 사사오입 개헌, 3차 내각 책임제 개헌은 빈출되며, 그 외에 6월 민주 항쟁으로 이루어진 9차 개헌 역시 자주 다루어진다. 그 외에는 해방 직후의 정국과 시기 순서를 묻는 문제, 각 정부 별 행적과 관련된 문제가 출제되며 남북관계 역시 높은 빈도(7회)로 출제된다.\n크게 주목할 만한 주제는 두 가지가 있는데, 우선 해방 직후의 상황에서부터 건국까지의 기 간이다. 이 시기에는 혼란한 정국과 좌우 갈등 및 합작 운동이 일어났으며, 미국과 소련의 개입 및 북한과의 접점이 겹쳐져 있다. 이 시점의 사건들에 대한 시간 순서를 확인해두는 것은 기본이고, 이승만의 정읍 발언이나 좌우 합작 위원회와 같은 주요 사건의 내용 역시 알아두는 것이 좋다.\n다음으로는 역대 정권에 일어난 사건을 묻는 형태 역시 빈출된다. 이 역시 두 가지로 다시 분류할 수 있는데, 각 정권의 수립과 몰락에 있어 큰 영향을 준 정치적 사건을 물을 수 있 고, 10년을 기준으로 정권별 사회경제 풍토를 묻는 유형이 등장할 수 있다. 여기서 간단히 정리하자면 다음과 같다.\n#주요 정치 사건\n- 이승만: 사사오입 개헌(2차 개헌), 4.19 혁명\n- 박정희(60년대): 5.16 군사 정변, 베트남 파병, 한일협정\n- 박정희(70년대): 7.4 남북공동성명, 10월 유신, 새마을 운동, 부마 민주 항쟁, 10.26 사건\n- 전두환: 12.12 쿠테타 및 신군부 집권, 광주 민주화 운동, 4.13 호헌 조치, 6월 민주 항쟁\n- 노태우: 올림픽 개최, 남북기본합의서\n- 김영삼: 금융실명제, 지방자치제 전면 시행, IMF\n- 김대중: IMF 극복 선언, 남북 정상 회담\n날짜와 연관짓는 사건들이 많이 등장하므로 헷갈리지 않도록 정리해두는 것이 좋다. 특히 각 정권의 붕괴와 관련된 사건에는 볼드 표시해두었다. 또한 북한과 연관지어 각 정부의 활 동을 묻기도 하니 따로 정리해두는 것이 좋다.\n\n# 시대별 사회경제\n- 50년대: 삼백 산업\n- 60년대: 1-2차 경제 개발 계획(경공업), 독일 광부&간호사 파견\n- 70년대: 3-4차 경제 개발 계획(중공업), 새마을 운동\n- 80년대: 3저 호황, 국풍 81, 3S 산업, 올림픽 개최\n- 90년대: OECD 가입, IMF 구제금융 요청\n주로 박정희 시대의 경제발전에 대해 묻는 경우가 많으나, 삼백 산업이나 3저 호황에 대해 서 묻는 경우도 종종 있다. 비교적 간단하니 빠르게 외워버리자.",
            "복합" : "분석자료가 없습니다.",
            "전삼국" : "전삼국 시대는 석기 시대부터 철기 시대까지를 아우르는 선사 시대와 고조선에서부터 부여, 동예 등이 등장하는 열국 시대로 구성되어 있다. 선사 시대는 대개 한 회차당 한 문제 나오 며, 시대 구분형 문제가 주로 출제되는데, 최근의 정답 보기는 대개 신석기 시대와 청동기 시대였다(각각 5회, 4회). 적어도 신석기 시대와 청동기 시대의 특징을 암기한다면 한 문제 는 쉽게 확보할 수 있다.\n열국 시대에서 정답 보기로 등장한 경우로는 부여 7회, 동예 4회, 옥저 3회, 고조선 5회 등 이 있다. 고조선과 부여의 특징은 별도로 정리해서 기억할 필요가 있다. 또한 최근 고조선 기출에서 역계경이나 준왕 등을 물어보는 고난도 유형이 두 차례 등장했으니 따로 기억할 필요가 있었다. 옥저와 동예는 정답으로도 등장하지만, 오답 보기로도 수차례 등장하니 정리 하여 기억해둔다면 소거법을 사용할 때 큰 도움이 될 것이다.",
            "기타" : "분석자료가 없습니다."
        },
        
        "type":{
            "시기구분" : "시기 구분형과 공간 구분형은 문자 그대로 시간과 공간이 문제의 요체를 차지하는 경 우를 뜻한다. 시기 구분형은 연속된 일련의 사건 속에서 묻는 사건이 일어난 시점을 고르는 문제나, 문제를 푸는 데 시대별 구분이 필요한 경우에 적용된다. 다른 유형에서도 복합적으 로 겹쳐져서 등장하는 경우가 많으며, 역사 문제의 기본기에 해당하므로 큰 줄기만큼은 숙 지해야 할 것이다. 따로 정리해서 암기하는 방식도 좋고, 많은 문제풀이를 통해 익숙해지는 방식도 좋다.",
            "공간구분" : "시기 구분형과 공간 구분형은 문자 그대로 시간과 공간이 문제의 요체를 차지하는 경 우를 뜻한다. 시기 구분형은 연속된 일련의 사건 속에서 묻는 사건이 일어난 시점을 고르는 문제나, 문제를 푸는 데 시대별 구분이 필요한 경우에 적용된다. 다른 유형에서도 복합적으 로 겹쳐져서 등장하는 경우가 많으며, 역사 문제의 기본기에 해당하므로 큰 줄기만큼은 숙 지해야 할 것이다. 따로 정리해서 암기하는 방식도 좋고, 많은 문제풀이를 통해 익숙해지는 방식도 좋다.",
            "해석" : "해석형은 가장 많은 문제 유형에 속한다. 그리고 이 유형의 문제가 다수 등장한다는 것이 한국사능력검정시험이 지향하는 방향을 알려준다. 해석형 문제는 독해능력과 역사지식의 결 합을 동시에 요구하는 문제이다. 요는 문제 내에서 핵심적인 키워드나 문장을 끌어낸 뒤, 이 를 연관된 역사적 사실이나 인물과 연관 지을 수 있어야 한다. 최근(27회 이후)에는 독해능 력과 약간의 역사적 상식만 있다면 풀 수 있는 언어영역적인 문제도 다수 출제되고 있으니 포기해서는 안 될 것이다.",
            "암기" : "암기형에 대한 분류에 있어서는 많은 사람들이 의아해할 수 있을 것이다. 어찌되었건 어떤 유형이건 역사적 지식에 대한 어느 정도의 암기는 요구하기 때문이다. 허나 여기에서 말하 는 암기형은 여타 문제와는 다르게 연관된 개념 등을 이용해 유추하는 점이 적고, 엄격한 암기가 요구되는 경우에만 분류하였다. 난이도가 높은 경우가 많으므로 효율을 추구한다면, 소수의 문화사 파트의 유물 및 유적만 간략하게 짚고 과감하게 넘겨도 괜찮을 것이다. 다만 빈출되거나 중요한 부분에 한해서는 놓치지 않도록 따로 표기해두었다.",
            "정리" : "문제에서 묻는 개념에 대한 서술을 모두 해둔 뒤, 이 개념과 관련된 다 른 일에는 무엇이 있는가? 등을 묻는 형태이다. 이 유형은 문제 자체가 해당 개념에 대해 상세하게 정리해둔 경우가 많으므로, 공부할 때에 유용하게 활용할 수 있다. 문제 자체뿐만이 아니라 보기를 적절히 활용하면, 핵심 개념과 관련된 한국사 시험의 전형적인 문장(패턴)들을 정리할 수 있다. 서술 자체에 익숙해지는 것이 좋다.",
            "테마" : "테마형이다. 이는 다른 유형으로도 분류할 수 있기는 하지만, 해당 문제에서 묻는 키워드가, 밀접하게 연관된 다른 키워드와 함께 보기에 등장하여 혼동을 유도하는 것을 지 칭한다. 가령 삼국의 전성기 준비와 전성기, 원효와 의상, 의천과 지눌, 발해 무왕과 문왕, 조선 태종과 세종의 업적 차이 등을 들 수 있다. 이는 테마별로 정리함으로써 정답률을 비 약적으로 높일 수 있으므로, 정리해두어 기억해두도록 하자. 이런 형태의 문제들은 대부분 문제 풀이에 관련 테마 요약을 첨부했으므로 활용하면 좋을 것이다. 시험장에 들어가기 전, 마지막으로 정리할 때에는 테마형 요약 정리를 훝어보는 것이 가장 효율이 뛰어날 것이다.",
            "국가구분" : "국가 구분형은 전근대 시대에 있어서는 주로 전삼국 시대에 빈출되는 유형이다. 근현대사에 오면 조선을 둘러싼 열강과 관련된 문제에 해당되기도 한다. 공간 구분형은 특정 지역의 역 사적 사실을 묻는 형태로 출제되는데, 해당 유형이 적고 난이도가 높은 편이기에 효율성을 따지자면 가볍게 넘기는 것을 권장한다."
        },
        
        "theme":{
            "국가" : "‘국가’ 분류는 주로 전삼국 시대~삼국 시대에 해당하는 분류이다. 전삼국 시대(여러 나라가 있다 하여 열국列國이라는 표현이 더 자주 쓰인다)의 고조선, 부여, 고구려, 옥저, 동예, 삼한 과 관련된 풍습이나 제도에 대해 묻는 형태가 주로 이에 해당된다. 공부 분량이 많지 않고 패턴이 일정하므로 테마별 정리로 쉽게 맞힐 수 있을 것이다.",
            "왕" : "‘왕’은 조선 시대에 주로 해당되는 분류이다. 삼국 시대에도 주목할 만한 왕이 몇몇 있으며 (고구려 - 소수림왕, 광개토대왕, 장수왕, 백제 – 무령왕, 성왕, 신라 – 지증왕, 법흥왕, 진흥 왕, 무열왕...) 이들에 대한 정리는 곧 삼국시대의 정치사 정리와 거의 영역이 비슷하다. 고려 시대에는 ‘왕’의 분류를 적용할 만한 인물로는 태조, 광종, 성종, 공민왕 정도면 충분하다. 고 려사는 왕보다는 사건이나(ex. 묘청의 난, 무신정변) 시기별 구분으로 접근하는 경우가 더 많다. ‘왕’ 분류는 조선 시대에서 굉장히 많이 쓰이는데, 사실상 시기별 구분의 역할을 ‘왕’의 항목이 대신한다고 할 수 있다. 그러나 태정태세문단세...와 같은 암기법은 현실적으로 쓸모 가 높지 않다.\n한국사 시험에서 다룰 법한 조선의 주요 왕을 순서대로 지적하면 다음과 같다.\n- 태조, 태종, 세종(특히 태종과 세종은 주된 테마 중 하나이다)\n- 단종, 세조(의외로 한국사 시험에서는 비교적 다루지 않는 편이다. 세조는 직전법 관련해서 언급되는 정도이다)\n- 성종(조선의 기틀이 잡힘)\n- 연산군 이후 명종까지(사화 시리즈)\n- 명종(을묘왜변, 임꺽정), 선조(임진왜란)\n- 광해군(중립 외교), 인조(인조반정과 정묘·병자호란)\n- 현종(2차례의 예송 논쟁)\n- 숙종(3차례의 환국)\n- 영조, 정조(조선의 중흥기)\n- 이하 생략(정조 이후는 거의 다루지 않음, 조선후기의 사회경제를 묻는 경우가 태반) 가급적이면 사건과 왕을 유기적으로 연관지어 기억해두는 것이 좋다. 얼핏 많아보이지만, 어 차피 문제를 풀다 보면 수차례 반복될 것이니 금방 익숙해질 것이다.",
            "사건" : "‘사건’ 항목은 주요 정치적 사건과 관련한 문제가 나왔을 때 적용된다. 이러니저러니 해도 정치사가 지니는 큰 비중은 무시할 수 없으므로 익숙해지도록 하자. 문제를 풀다보면 알겠 지만, 한국사시험에서 묻는 시대별로 나오는 정치적 사건은 한정되어 있으므로 어느 수준 이상 올라가면 쉽게 풀 수 있을 것이다. 다만 고난이도의 해석형에서는 관련된 키워드를 읽 어내는 것이 요구된다. 한국사 시험이 어려운 회차의 경우, 잘 알려져 있지 않은 키워드를 내세워 문제를 꼬는 경우가 굉장히 많다.",
            "제도" : "‘제도’는 통치 시스템과 관련된 문제에 해당한다. 주로 삼국시대의 제가 회의, 정사암 회의, 화백 회의라던가, 고려나 조선의 중앙 관제에 대해 묻는 경우가 많다. 조선의 중앙 관졔는 테마로 정리해서 암기하도록 하자. 그 외에도 관리의 급료 제공 방식인 신문왕 – 관료전& 녹읍, 고려의 전시과, 조선의 과전법&직전법까지는 빈출되는 편이다(허나 3가지 전시과의 구분에 대해서까지는 잘 묻지 않는다. 조선의 관수관급제나 녹읍제 역시 잘은 묻지 않는 편 이다). 번외로 조선 중기 이후에 시행된 대동법은 상세하게 묻는 편이므로 자세하게 알아둘 필요가 있다. 근현대사 파트에 등장하는 각종 조약이나 선언 역시 이 분류에 속하게 했다.",
            "경제" : "‘경제’ 항목은 전근대 시대에 있어서 주로 고려, 조선 전기, 조선 후기로 구분하면 그것으로 충분하다. 그나마도 조선 후기만 정리해두어도 나머지는 어림짐작으로 맞힐 수 있을 정도이 다. 근현대사에서는 일제 강점기의 시대별 구분이나, 해방 이후의 시대별 경제 상황으로 종 종 나오므로 테마별 정리를 이용하도록 하자. 번외로 종종 메가타의 화폐 정리 사업(1905) 는 따로 기억해두자.",
            "사회" : "‘사회’ 항목은 국사 파트에서 조선 전기와 후기로 구분하면 대개 충분하다. 여성 문제와 결 부되는 경우, 고려~조선 전기까지는 비교적 남녀 차별이 적은 편이었지만 임란 이후에 성리 학이 극도로 강조되어 갔다고 생각하면 된다. 조선이 아닌 경우에는 주로 통일신라 하대의 상황이나, 고려 무신정권기, 원간섭기 등이 등장하는 편이다. 나올 부분이 한정되어 있고 보 기의 서술에 패턴이 있으니 익숙해지도록 노력하자. 근현대사에 있어서는 일제 강점기 시기 의 시기별 사회 풍습(10년대/20년대/30년대 초/30년대 말~45년)을 묻는 문제가 많이 등장한 다. 한번만 따로 정리해두면 두어 문제는 손쉽게 맞힐 수 있다.",
            "문화" : "‘문화’ 항목은 사진 자료에 익숙해져야 한다. 대개 지나치게 어려운 문제는 외우지 말라고 풀이에서 표시해둘 것이다. 거꾸로 말하면 그렇지 않은 이미지와 이름, 특징은 많이 등장하 므로 기억해두도록 하자. 대개 암기형에 속하는 편이다. 그러나 2차 분류에서 테마형으로 분 류한 경우에는, 비교적 빈출되는 유형이고 정치 등과 연관점이 높은 경우가 많으므로 반드 시 정리해두도록 하자. 근현대사의 문화 파트는 몇몇 부분은 전략적으로 버리는 것이 좋다. 단적인 예로 근대 조선 시기에 지어진 건축물이나 철도, 각종 문화 행사 등을 두고 시기 구 분을 묻는 유형이 있는데, 이는 노력에 비해 효율이 지나치게 떨어지는 경우라 할 수 있다.",
            "인물" : "‘인물’ 항목은 국사, 근현대사 가릴 것 없이 폭넓게 등장한다. 임금이 아닌 경우에만 넣었으 며, 인물은 정치사와 연관된 경우가 많으므로 저절로 기억될 것이다. 근현대사에 있어서는 독립운동가에 대한 인물사를 묻는 문제가 많은 편이다. 신채호, 박은식, 안창호 정도는 아주 자주 등장하므로 반드시 정리하자.",
            "단체" : "‘단체’ 항목은 주로 근현대사 파트에 해당한다. 독립운동 단체별로 묻는 경우가 많으니 테마 별로 잘 정리해두도록 하자. 빈출되는 단체로는, 독립 협회, 의열단, 신민회, 임정, 신간회 등 이 있다.",
            "유물" : "‘유물’ 항목은 ‘문화’와 겹치는 경우가 있으나, 주로 정치사&해석형과 겹쳐져서 나오는 경우 에 이에 분류하였다. 주요 사건이나 왕의 업적과 관련된 경우가 많으니 연관지어 기억하도 록 하자. 대표적으로 선사 시대 유물·유적들이나, 광개토대왕비, 중원 고구려비, 진흥왕 순수 비 시리즈(+단양 적성비) 등이 있다. (편의에 따라 유물과 유적을 특별히 따로 구분하지는 않았다)",
            "복합" : "‘복합’은 말 그대로 여러 항목이 대등하거나 그에 준하는 형태로 엮여 있는 경우에 해당된 다. 여러 시대를 겹쳐서 논하는 공간 구분형 문제나, 문화사 문제로 나오는 경우가 많다. 그 외에 특수한 케이스로 독도 문제는 정치사에 해당되지만 이에 속한다.",
            "기타" : "‘기타’는 정말 번외의 문제를 넣어두었다. 사실상 그냥 세시풍속 문제라고 보아 도 무방하다. 세시풍속은 대개 상식으로 풀 수 있는 경우가 많고, 설사 모른다고 해도 1점인 경우가 굉장히 많으니 간과해도 무방하다."
        }
    }
    
}
